ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/ПротоколОФПСдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколОФПСдачаНормативов</name>
  <basedOn>Document.СоревнованиеОФПСдачаНормативов</basedOn>
  <registerRecords>InformationRegister.ДостиженияСпортсменовПоПротоколу</registerRecords>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.РезультатыВыполненияПоказателейИНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыПараметровСоревнованиийОФПСдачаНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СоревнованиеОФПСдачаНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоревнования</name>
    <type>
      <types>EnumRef.ТипыСдачиНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Очки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Попытки</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПопытки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПопытки</name>
      <type>
        <types>CatalogRef.СостоянияПопыток</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявленныеНормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиЗаявленногоНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ПротоколОФПСдачаНормативов/ObjectModule.bsl
// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ПроведениеСервер.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов");
    ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "РезультатыВыполненияПоказателейИНормативов");
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "РезультатыПараметровСоревнованиийОФПСдачаНормативов");
	
	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовОтменыПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СоревнованиеОФПСдачаНормативов") Тогда
		
		ЗаполнитьПротоколНаОснованиеДокумента(ДанныеЗаполнения);	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПротоколНаОснованиеДокумента(ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Дата, Номер");
	ДокументОснование = ДанныеЗаполнения;
	
	Для Каждого СтрокаНорматив Из ДанныеЗаполнения.ЗаявленныеНормативы Цикл
		СтрокаНормативОбъект                                                   = ЗаявленныеНормативы.Добавить();
		СтрокаНормативОбъект.Норматив                                          = СтрокаНорматив.Норматив;
		СтрокаНормативОбъект.УникальныйИдентификаторСтрокиЗаявленногоНорматива = СтрЗаменить(СтрокаНорматив.УникальныйИдентификаторНорматива,"_","-");
	КонецЦикла;	
	
	Для Каждого строкаДанныеЗаполнения Из ДанныеЗаполнения.СоставУчастников Цикл
		строкаСоставУчастников = СоставУчастников.Добавить();
		ЗаполнитьЗначенияСвойств(строкаСоставУчастников,строкаДанныеЗаполнения);
		строкаСоставУчастников.УникальныйИдентификаторСтрокиЗаявленногоНорматива = СтрЗаменить(строкаДанныеЗаполнения.УникальныйИдентификаторНорматива,"_","-");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
